# Цикл

# Ввести с клавиатуры строку.
# Вывести эту же строку вертикально: по одному символу на строку консоли.

for symbol in input():
    print(symbol)