# Цикл

# Создать список из десяти целых чисел.
# Вывести на экран каждое число, увеличенное на 1.

my_list = [1, 2, 0, 3, 5, 13, 9, 19, 29, 55]
for score in my_list:
    score += 1
    print(score)